[
    {
        "name": "Naveen Raj",
        "email": "717823i233@kce.ac.in",
        "description": "That's an adorable **kitten**.  More specifically, it appears to be a young tabby cat.\n",
        "image_path": "temp_uploaded_image.png",
        "timestamp": "2025-09-19 14:02:51"
    },
    {
        "name": "Deepthi",
        "email": "717823i107@kce.ac.in",
        "description": "This interactive dashboard provides a detailed analysis of college placements from Karpagam College of Engineering, spanning the years 2014-2018.  The data is visualized using a combination of charts and maps, offering a comprehensive overview of placement trends across various dimensions.  The dashboard was created by Naveen Raj.\n\n**1. Company Placement Count:** This bar chart displays the total number of students placed by each company.  Infosys and Capgemini are clearly identified as the top recruiters, significantly outpacing other companies.  The chart includes specific numerical values for each company, allowing for precise comparison.  The x-axis lists the company names, and the y-axis represents the number of placements.\n\n**2. Company Salary Range Heatmap:** This heatmap provides a visual representation of the salary ranges offered by different companies. Companies are clustered according to similar salary structures, making it easy to identify salary tiers. The color intensity corresponds to the salary range, with darker shades indicating higher salaries.  Capgemini is highlighted as offering a high salary range, but specific salary bands (e.g.,  ₹X - ₹Y) should be included for clarity and better understanding.  The legend clearly defines the color-to-salary mapping.\n\n**3. Regional Salary Distribution Map:** This geographical map displays the average salary offered in different regions: Pune, Thane, and Navi Mumbai. The color intensity of each region directly correlates with the average salary; darker shades represent higher average salaries.  Pune is shown to have the highest concentration of higher-paying jobs. Specific average salary figures for each region would enhance the map's utility.\n\n**4. Company Participation by Region:** This bar chart showcases the number of companies that offered placements in each region. Pune and Mumbai are depicted as having the highest number of participating companies, indicating a greater concentration of recruitment opportunities in these areas.  Numerical values are presented for each region, facilitating direct comparison.\n\n**5. Placement and Salary Trends Over Time (2014-2018):** This line graph illustrates the trends in both the total number of placements and the total salary offered across the years 2014-2018.  It clearly shows a significant increase in both metrics from 2017 to 2018, indicating substantial growth in placement opportunities and overall compensation. The graph includes clearly labeled axes (year, number of placements, and total salary offered) with numerical values for data points.\n\n\n**Overall:**  This dashboard offers a robust and insightful analysis of college placements, facilitating a comprehensive understanding of recruitment trends.  The use of multiple visualization techniques allows for effective communication of complex data.  The consistent color scheme and clear labeling enhance readability and understanding.   The inclusion of specific numerical data points in each chart would further increase the dashboard's value by providing precise figures for analysis and comparison. The attribution to Naveen Raj from Karpagam College of Engineering is prominently displayed in the top right corner.\n",
        "image_path": "temp_uploaded_image.png",
        "timestamp": "2025-09-19 14:07:35"
    }
]